---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilterIntegerRule
source: html/50f01fab-23c4-619a-2831-3d5050ae0e71.htm
---
# FilterIntegerRule Methods

Derived classes override this method to implement the test that determines
 whether the given element passes this rule or not.